第一hello word
ipython>>>
print( 'hello word' )
#####################
vim hello.py
#!/usr/bin/python	
 print('hello word')
#########################
pytho ./hello.py |chmod +x hello.py
############################################
运算符：
算术运算符： + - * /(自然除) %  //（齐整除） **（次方）
比较运算符： == != > >= < <= 
		整形可直接与浮点比较
＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃
逻辑运算：
and 与
or 或
not 非
短路运算：
add(1,3)>add(1,2) and add(2,4)<add(3,4)
bin()	转换为二进制。
###########################################
按位与
& 按位与
|　按位或
^　按位异或。
~ 按位取反。
>>按位左移。
<<按位右移。
＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃

